const axios = require('axios');
const URL = "https://new.czn-office.ru/api/ankets/saveAnketFormData"
const method = "POST" 
const body = {
    "configId":"167679",
    "email":null,
    "userName":"Владислав",
    "regnumber":null,
    "cznName":177752,
    "answers":"[[9,9,9,0,9,9,9,9,9,9,9,0,9,1,0,9,9,9,9,null],[0,3,[8,6,4,3,0,9]]]"
}

const r = (min, max) => {
    return Math.floor(Math.random() * (max - min + 1)) + min;
}
const r9 = () => {
    return r(7, 9)
}
const maleNames = [
    "Александр",'', "Дмитрий", "Иван", "Михаил", "Сергей", '',"Андрей",'', "Алексей", '',"Владимир", 
    "Юрий", "Василий", "Константин",'', "Павел", "Роман", "Григорий", "Евгений",'', "Аркадий", 
    "Олег",'', "Николай", '',"Виктор", "Максим", '',"Валентин",'', "Анатолий", "Леонид", "Борис", 
    "Ярослав", "'',Игорь", "Эдуард", "Станислав", "Георгий", "Фёдор",'', "Антон", "Тимофей", 
    "Виталий", "Егор", "Кирилл", "Артём", "Денис", "Леонид", "Арсений",'', "Даниил", "Матвей", 
    "Альберт", "Глеб", "Назар", '',"Игнат", '',"Тихон", "Прохор", "Ростислав", "Всеволод", 
    "Владислав",'', "Яков", "Юлиан", "Савелий", '',"Мирон", "Родион"
  ];

  const femaleNames = ['',
    "Александра", "Анна", "Мария", "Екатерина", "Ольга", "Ирина", "Татьяна", "Наталья", 
    "Елена", '',"Светлана",'', "Юлия", "Виктория", '',"Алина", "Валентина", "Галина", '',"Полина", 
    "Вероника",'', "Кристина",'', "Дарья", "Лариса", '',"Надежда", "Евгения", "Марина",'', "Вера", 
    "Ксения", '',"Анастасия",'', "Зоя", "Нина", "Любовь",'', "Алёна", "Лидия", "Раиса", "Эльвира", 
    "Алиса",'', "Олеся",'', "Таисия", "Диана", "Карина", "Людмила", "Римма", "Софья", "Яна", 
    "Лилия", "Милана",'', "Агния", "Ульяна", "Василиса",'', "Элеонора", "Елизавета", "Варя", 
    "Дарина", "Жанна", "Марта", "Эмилия", "Аделина", '',"Арина"
];

function getRandomName(array) {
    return array[Math.floor(Math.random() * array.length)];
}


const variantsMen = {
    'мужчина выпускник школы 18-19': [0, 1, [5]],
    'мужчина выпускник средне-профессионального': [0, 2,[6]],
    'мужчина инвалид 20-29': [0,2, [2]],
    'мужчина инвалид 30-39': [0,3, [2]],
    'мужчина инвалид 40-49': [0,4, [2]],
    'мужчина инвалид 50-59': [0,5, [2]],

    'мужчина сокращение 20-29': [0,2, [4]],
    'мужчина сокращение 30-39': [0,3, [4]],
    'мужчина сокращение 40-49': [0,4, [4]],
    'мужчина сокращение 50-59': [0,5, [4]],

    'мужчина не работающий больше года 20-29': [0,2, [8]],
    'мужчина не работающий больше года 30-39': [0,3, [8]],
    'мужчина не работающий больше года 40-49': [0,4, [8]],
    'мужчина не работающий больше года 50-59': [0,5, [8]],

    'мужчина предпенсионного возраста 50-59': [0,5, [0]],
    'мужчина предпенсионного возраста 60-69': [0,6, [0]],

    'мужчина пенсионер 70+': [0,7, [1]],

    'мужчина случайный возраст не относится ни к одной категории граждан': [0, r(0, 7), [9]]
}
const variantsWomen = {
    'женщина выпускница школы 18-19': [1, 1, [5]],
    'женщина выпускница средне-профессионального': [1, 2, [6]],
    'женщина инвалид 20-29': [1, 2, [2]],
    'женщина инвалид 30-39': [1, 3, [2]],
    'женщина инвалид 40-49': [1, 4, [2]],
    'женщина инвалид 50-59': [1, 5, [2]],

    'женщина сокращение 20-29': [1, 2, [4]],
    'женщина сокращение 30-39': [1, 3, [4]],
    'женщина сокращение 40-49': [1, 4, [4]],
    'женщина сокращение 50-59': [1, 5, [4]],

    'женщина не работающая больше года 20-29': [1, 2, [8]],
    'женщина не работающая больше года 30-39': [1, 3, [8]],
    'женщина не работающая больше года 40-49': [1, 4, [8]],
    'женщина не работающая больше года 50-59': [1, 5, [8]],

    'женщина предпенсионного возраста 50-59': [1, 5, [0]],
    'женщина предпенсионного возраста 60-69': [1, 6, [0]],

    'женщина пенсионер 70+': [1, 7, [1]],

    'женщина случайный возраст не относится ни к одной категории граждан': [1, r(0, 7), [9]]
};

const allVarinats = {
    ...variantsMen,
    ...variantsWomen
}

const sendVote = (key) => {
    const isMan = key.startsWith('мужчина')
    const part1 = [r9(),r9(),r9(),0,r9(),r9(),r9(),r9(),r9(),r9(),r9(),0,r9(),1,0,r9(),r9(),r9(),r9(),null]
    const part2 = allVarinats[key] || allVarinats['мужчина случайный возраст не относится ни к одной категории граждан']
    const name = getRandomName(isMan ? maleNames : femaleNames)
    const body =  {
        "configId":"167679",
        "email":null,
        "userName": name,
        "regnumber":null,
        "cznName":177752,
        "answers": JSON.stringify([part1, part2]),
    }
    axios({
        method,
        url: URL,
        data: body,
        headers: {
            'Content-Type': 'application/json'
        }
    })
    .then(response => {
        console.log('Response:', response);
    })
    .catch(error => {
        console.error('Error:', error.response ? error.response.data : error.message);
    });
}

module.exports = {
    sendVote
}